environments_harbor/wrk_http_benchmarking_hard/environment/data/benchmarks/endpoint_orders_benchmark.txt
Running 30s test @ http://api.production.internal/v1/orders
  10 threads and 400 connections
  Thread calibration: mean lat.: 4523.456ms, rate sampling interval: 18087ms
  Thread calibration: mean lat.: 4612.345ms, rate sampling interval: 18096ms
  Thread calibration: mean lat.: 4489.234ms, rate sampling interval: 18104ms
  Thread calibration: mean lat.: 4556.789ms, rate sampling interval: 18079ms
  Thread calibration: mean lat.: 4634.567ms, rate sampling interval: 18112ms
  Thread calibration: mean lat.: 4501.234ms, rate sampling interval: 18091ms
  Thread calibration: mean lat.: 4578.901ms, rate sampling interval: 18086ms
  Thread calibration: mean lat.: 4445.678ms, rate sampling interval: 18095ms
  Thread calibration: mean lat.: 4590.123ms, rate sampling interval: 18088ms
  Thread calibration: mean lat.: 4512.345ms, rate sampling interval: 18099ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   187.45ms   89.34ms   987.65ms   72.34%
    Req/Sec    68.23     23.45    156.00     65.43%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%  156.78ms
 75.000%  198.45ms
 90.000%  212.34ms
 99.000%  234.56ms
 99.900%  456.78ms
 99.990%  789.12ms
 99.999%  945.67ms
100.000%  987.65ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

      45.567     0.000000            1         1.00
      78.234     0.100000         1987         1.11
      92.345     0.200000         3945         1.25
     108.456     0.300000         5923         1.43
     132.567     0.400000         7889         1.67
     156.789     0.500000         9867         2.00
     167.890     0.550000        10845         2.22
     178.901     0.600000        11834         2.50
     186.234     0.650000        12812         2.86
     192.345     0.700000        13801         3.33
     198.456     0.750000        14789         4.00
     203.567     0.775000        15278         4.44
     207.890     0.800000        15767         5.00
     209.123     0.825000        16256         5.71
     210.456     0.850000        16745         6.67
     212.345     0.900000        17734         10.00
     215.678     0.925000        18223         13.33
     218.901     0.937500        18467         16.00
     221.234     0.950000        18712         20.00
     224.567     0.962500        18956         26.67
     228.890     0.975000        19201         40.00
     230.123     0.981250        19323         53.33
     231.456     0.987500        19445         80.00
     234.567     0.990000        19567        100.00
     289.012     0.993750        19689        160.00
     345.678     0.996875        19811        320.00
     398.234     0.998438        19872        640.00
     456.789     0.999000        19903       1000.00
     523.456     0.999512        19964       2048.00
     612.345     0.999756        19995       4096.00
     701.234     0.999878        20010       8192.00
     789.123     0.999902        20018      10240.00
     834.567     0.999939        20026      16384.00
     876.234     0.999969        20034      32768.00
     912.345     0.999985        20038      65536.00
     945.678     0.999992        20041     131072.00
     967.890     0.999996        20043     262144.00
     976.543     0.999998        20045     524288.00
     987.654     1.000000        20046          inf
#[Mean    =      187.453, StdDeviation   =       89.342]
#[Max     =      987.654, Total count    =        20046]
#[Buckets =           27, SubBuckets     =         2048]
  19623 requests in 30.02s, 8.92MB read
  Socket errors: connect 0, read 0, write 0, timeout 127
  Requests/sec:    654.32
  Transfer/sec:    304.23KB