environments_harbor/wrk_http_benchmarking_hard/environment/data/benchmarks/endpoint_products_benchmark.txt
Running 30s test @ http://api.example.com/v1/products
  10 threads and 400 connections
  Thread calibration: mean lat.: 34.567ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 35.123ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 33.891ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 34.782ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 35.456ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 34.234ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 33.678ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 35.890ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 34.901ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 35.234ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    34.56ms   10.23ms  156.78ms   75.60%
    Req/Sec   157.89    45.67   312.00    68.50%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   32.45ms
 75.000%   41.23ms
 90.000%   48.67ms
 99.000%   56.34ms
 99.900%   89.12ms
 99.990%  134.56ms
 99.999%  152.34ms
100.000%  156.78ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

      12.345     0.000000            1         1.00
      18.567     0.100000         4712         1.11
      23.123     0.200000         9423         1.25
      27.456     0.300000        14135         1.43
      29.890     0.400000        18847         1.67
      32.445     0.500000        23558         2.00
      33.678     0.550000        25914         2.22
      35.234     0.600000        28270         2.50
      37.123     0.650000        30626         2.86
      39.456     0.700000        32982         3.33
      41.234     0.750000        35338         4.00
      42.567     0.775000        36516         4.44
      43.890     0.800000        37694         5.00
      45.123     0.825000        38872         5.71
      46.789     0.850000        40050         6.67
      48.678     0.900000        42406        10.00
      49.567     0.925000        43584        13.33
      50.890     0.950000        44762        20.00
      52.123     0.962500        45351        26.67
      53.456     0.975000        45940        40.00
      54.789     0.981250        46234        53.33
      56.345     0.990000        46623       100.00
      58.123     0.993750        46918       160.00
      60.456     0.996875        47212       320.00
      65.234     0.998437        47359       640.00
      72.890     0.999219        47506      1280.00
      89.123     0.999609        47580      2560.00
     108.456     0.999805        47653      5120.00
     123.678     0.999902        47690     10240.00
     134.567     0.999951        47706     20480.00
     142.234     0.999976        47724     40960.00
     148.567     0.999988        47733     81920.00
     152.345     0.999994        47738    163840.00
     154.123     0.999997        47742    327680.00
     155.678     0.999998        47745    655360.00
     156.234     0.999999        47747   1310720.00
     156.789     1.000000        47050   2621440.00

  47050 requests in 30.01s, 85.34MB read
  Socket errors: connect 0, read 0, write 0, timeout 0
  Requests/sec:   1567.89
  Transfer/sec:      2.84MB